{
  "EECS 101": {
    "4219": {
      "miniDesc": "EECS 101 Elect Engr & Computer Science - New Student Seminar ( 1 )",
      "description": "A seminar intended to help connect freshmen and transfer EECS students to the EECS department, their chosen profession, and each other. Topics include overviews of the various disciplines, curricula and advising, ethics and professionalism, student organizations and extracurricular activities, senior projects, and career planning. Graded on a satisfactory/unsatisfactory basis. Prerequisite: Corequisite: MATH 104.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 137": {
    "4212": {
      "miniDesc": "EECS 137 Elect Engr & Computer Science - Visual Basic for Engineers ( 3 )",
      "description": "Introduction of computer-based problem solving techniques for engineering practice with emphasis on good programming practices and the integration of appropriate computational and related tools. Solutions are computed using Visual Basic, specifically VBA within Excel. Elementary numerical and statistical methods are applied to the solution of sets of linear and nonlinear algebraic equations, linear regression, and root finding. Microsoft Office is used with the computational tools to provide integrated report generation capability. Two lectures and a weekly laboratory instruction. Prerequisite: MATH 104.",
      "terms": [
        "4212",
        "4219"
      ]
    }
  },
  "EECS 138": {
    "4212": {
      "miniDesc": "EECS 138 Elect Engr & Computer Science - Introduction to Computing: ( 3 / NM )",
      "description": "Algorithm development, basic computer organization, syntax and semantics of a high-level programming language, including testing and debugging. Concept of structure in data and programs, arrays, top-down design, subroutines and library programs. Abstract data types. System concepts such as compilation and files. Nature and scope of computer science. Not open to electrical engineering, computer engineering, computer science, and interdisciplinary computing majors. Prerequisite: MATH 101 or MATH 104, or meeting the requirements to enroll in MATH 115 or MATH 125 or MATH 145. Satisfies: NM Mathematical Sciences PC (NM)",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 140": {
    "4212": {
      "miniDesc": "EECS 140 Elect Engr & Computer Science - Introd to Digital Logic Design ( 4 )",
      "description": "An introductory course in digital logic circuits covering number representation, digital codes, Boolean Algebra, combinatorial logic design, sequential logic design, and programmable logic devices. Grade of C (not C-) required to progress. Prerequisite: Corequisite: MATH 104.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 141": {
    "4212": {
      "miniDesc": "EECS 141 Elect Engr & Computer Science - Intro to Digital Logic: Honors ( 4 / Honors )",
      "description": "An introductory course in digital logic circuits covering number representation, digital codes, Boolean algebra, combinatorial logic design, sequential logic design, and programmable logic devices. This course is intended for highly motivated students and includes honors-level assignments. Grade of C (not C-) required to progress. Prerequisite: Corequisite: MATH 104, plus either acceptance into the KU Honors Program or consent of instructor.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 168": {
    "4212": {
      "miniDesc": "EECS 168 Elect Engr & Computer Science - Programming I ( 4 )",
      "description": "Problem solving using a high level programming language and object oriented software design. Fundamental stages of software development are discussed: problem specification, program design, implementation, testing, and documentation. Introduction to programming using an object oriented language: using classes, defining classes, and extending classes. Introduction to algorithms and data structures useful for problem solving: arrays, lists, files, searching, and sorting. Student will be responsible for designing, implementing, testing, and documenting independent programming projects. Professional ethics are defined and discussed in particular with respect to computer rights and responsibilities. Grade of C (not C-) required to progress. Prerequisite: Corequisite: MATH 104.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 169": {
    "4212": {
      "miniDesc": "EECS 169 Elect Engr & Computer Science - Programming I: Honors ( 4 / Honors )",
      "description": "Problem solving using a high level programming language and object oriented software design. Fundamental stages of software development are discussed: problem specification, program design, implementation, testing, and documentation. Introduction to programming using an object oriented language: using classes, defining classes, extending classes. Introduction to algorithms and data structures useful for problem solving: arrays, lists, files, searching, and sorting. Students will be responsible for designing, implementing, testing, and documenting independent programming projects. Professional ethics are defined and discussed in particular with respect to computer rights and responsibilities. This course is intended for highly motivated students and includes honors-level assignments. Grade of C (not C-) required to progress. Prerequisite: Corequisite: MATH 104, plus either acceptance into the KU Honors Program or consent of instructor.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 202": {
    "4212": {
      "miniDesc": "EECS 202 Elect Engr & Computer Science - Circuits I ( 4 )",
      "description": "Analysis of linear electrical circuits: Kirchoff's laws; source, resistor, capacitor and inductor models; nodal and mesh analysis; network theorems; transient analysis; Laplace transform analysis; steady-state sinusoidal analysis. The lab provides training and practice in the use of computational tools (e.g., Matlab), computer-aided circuit analysis (e.g., Pspice), and laboratory skills. Prerequisite: MATH 220 and MATH 290.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222"
      ]
    },
    "4229": {
      "miniDesc": "EECS 202 Elect Engr & Computer Science - Circuits I ( 4 )",
      "description": "Analysis of linear electrical circuits: Kirchoff's laws; source, resistor, capacitor and inductor models; nodal and mesh analysis; network theorems; transient analysis; Laplace transform analysis; steady-state sinusoidal analysis. The lab provides training and practice in the use of computational tools (e.g., Matlab), computer-aided circuit analysis (e.g., Pspice), and laboratory skills. Prerequisite: Corequisite: MATH 220 and MATH 290.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 210": {
    "4212": {
      "miniDesc": "EECS 210 Elect Engr & Computer Science - Discrete Structures ( 4 )",
      "description": "Mathematical foundations including logic, sets and functions, general proof techniques, mathematical induction, sequences and summations, number theory, basic and advanced counting techniques, solution of recurrence relations, equivalence relations, partial order relations, lattices, graphs and trees, algorithmic complexity, and algorithm design and analysis. Throughout there will be an emphasis on the development of general problem solving skills including algorithmic specification of solutions and the use of discrete structures in a variety of applications. Grade of C (not C-) required to progress. Prerequisite: EECS 168 or 169 (or equivalent) and MATH 122 or MATH 126 or MATH 146.",
      "terms": [
        "4212"
      ]
    },
    "4219": {
      "miniDesc": "EECS 210 Elect Engr & Computer Science - Discrete Structures ( 4 )",
      "description": "Mathematical foundations including logic, sets and functions, general proof techniques, mathematical induction, sequences and summations, number theory, basic and advanced counting techniques, solution of recurrence relations, equivalence relations, partial order relations, lattices, graphs and trees, algorithmic complexity, and algorithm design and analysis. Throughout there will be an emphasis on the development of general problem solving skills including algorithmic specification of solutions and the use of discrete structures in a variety of applications. Grade of C (not C-) required to progress. Prerequisite: EECS 140 or EECS 141, EECS 168 or EECS 169 (or equivalent) and MATH 122 or MATH 126 or MATH 146.",
      "terms": [
        "4219",
        "4222"
      ]
    },
    "4229": {
      "miniDesc": "EECS 210 Elect Engr & Computer Science - Discrete Structures ( 4 )",
      "description": "An introduction to the mathematical foundations and techniques of computer science. Throughout, there is an emphasis on general reasoning, problem solving, and technical communication. Topics include basic proof techniques and logic, induction, recurrences, relations, number theory, basic algorithm design and analysis, and applications. Grade of C (not C-) required to progress. Prerequisite: EECS 140 or EECS 141, EECS 168 or EECS 169 (or equivalent) and MATH 122 or MATH 126 or MATH 146.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 212": {
    "4212": {
      "miniDesc": "EECS 212 Elect Engr & Computer Science - Circuits II ( 4 )",
      "description": "Continued study of electrical circuits: Steady-state power analysis, three-phase circuits, transformers, frequency response, and two-port network analysis. Grade of C (not C-) required to progress. Prerequisite: EECS 211 or EECS 202.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 221": {
    "4212": {
      "miniDesc": "EECS 221 Elect Engr & Computer Science - Electromagnetics I ( 3 )",
      "description": "Electrostatic and magnetostatic fields in a vacuum and material media. Electromagnetic fields and Maxwell's equations for time-varying sources. The relationship between field and circuit theory. Simple applications of Maxwell's equations. Grade of C (not C-) required to progress. Prerequisite: MATH 127, MATH 220, EECS 211 or EECS 202, and either PHSX 210 or PHSX 211.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 268": {
    "4212": {
      "miniDesc": "EECS 268 Elect Engr & Computer Science - Programming II ( 4 )",
      "description": "This course continues developing problem solving techniques by focusing on the imperative and object-oriented styles using Abstract Data Types. Basic data structures such as queues, stacks, trees, and graphs will be covered. Recursion. Basic notions of algorithmic efficiency and performance analysis in the context of sorting algorithms. Basic Object-Oriented techniques. An associated laboratory will develop projects reinforcing the lecture material. Three class periods and one laboratory period per week. Grade of C (not C-) required to progress. Prerequisite: EECS 168 or EECS 169.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 312": {
    "4212": {
      "miniDesc": "EECS 312 Elect Engr & Computer Science - Electronic Circuits I ( 3 )",
      "description": "Introduction to diodes, BJTs and MOSFETs, and their use in electronic circuits, especially digital circuits. Prerequisite: Upper-level eligibility. Corequisite: EECS 212.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 315": {
    "4212": {
      "miniDesc": "EECS 315 Elect Engr & Computer Science - Electric Circuits and Machines ( 3 )",
      "description": "Introduction to DC and AC electrical circuit analysis techniques, AC power calculations, transformers, three-phase systems, magnetic circuits, and DC and AC machines with a focus on applications. Not open to electrical or computer engineering majors. (Same as ARCE 315.) Prerequisite: A course in differential equations and eight hours of physics.",
      "terms": [
        "4212"
      ]
    }
  },
  "EECS 316": {
    "4212": {
      "miniDesc": "EECS 316 Elect Engr & Computer Science - Circuits, Electroncs&Instrmntn ( 3 )",
      "description": "Introduction to DC and AC electrical circuit analysis, operational amplifiers, semiconductors, digital circuits and systems, and electronic instrumentation and measurements with a focus on applications. Not open to electrical or computer engineering majors. Students may not receive credit for both EECS 316 and EECS 317. Prerequisite: A course in differential equations and eight hours of physics.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 317": {
    "4212": {
      "miniDesc": "EECS 317 Elect Engr & Computer Science - Electronics & Instrumentation ( 2 )",
      "description": "Introduction to operational amplifiers, semiconductors, digital circuits and systems, and electronic instrumentation and measurements with a focus on applications. Not open to electrical or computer engineering majors. Students may not receive credit for both EECS 316 and EECS 317. Prerequisite: EECS 315.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 318": {
    "4212": {
      "miniDesc": "EECS 318 Elect Engr & Computer Science - Circuits and Electronics Lab ( 1 )",
      "description": "Laboratory exercises intended to complement EECS 316 and EECS 317. Experiments include DC circuits, analog electronics, and digital electronics. Not open to electrical or computer engineering majors. Prerequisite: Corequisite: EECS 316 or EECS 317.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 330": {
    "4232": {
      "miniDesc": "EECS 330 Elect Engr & Computer Science - Data Structures and Algorithms ( 4 )",
      "description": "A first course in abstract data structures and algorithmic design making use of these structures. Topics include asymptotic analysis, trees, dictionaries, heaps, disjoint set structures; divide and conquer, greedy, and dynamic programming algorithms. Prerequisite: EECS 210, EECS 268, and upper-level EECS eligibility.",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 348": {
    "4232": {
      "miniDesc": "EECS 348 Elect Engr & Computer Science - Software Engineering I ( 4 )",
      "description": "This course is an introduction to software development fundamentals and software engineering. It incorporates a thorough introduction to a compiled programming language. A baseline knowledge of tools and utilities is covered including the shell, common programs, version control, IDEs, editors, and build tools. Topics include: software development principles (e.g., design patterns, modularity, loose coupling), extending larger codebases, developing larger codebases, continuous integration, continuous deployment, debugging, unit testing, test-driven development, and databases. Grade of C (not C-) required to progress. Prerequisite: EECS 268.",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 360": {
    "4212": {
      "miniDesc": "EECS 360 Elect Engr & Computer Science - Signal and System Analysis ( 4 )",
      "description": "Fourier signal analysis (series and transform); linear system analysis (continuous and discrete); Z-transforms; analog and digital filter analysis. Analysis and design of continuous and discrete time systems using MATLAB. Prerequisite: Upper level of EECS Eligibility, and EECS 212.",
      "terms": [
        "4212",
        "4219"
      ]
    }
  },
  "EECS 361": {
    "4219": {
      "miniDesc": "EECS 361 Elect Engr & Computer Science - Signal and System Analysis ( 3 )",
      "description": "Fourier signal analysis (series and transform); linear system analysis (continuous and discrete); z-transforms, analog and digital filter analysis; analysis and design of continuous and discrete time system using MATLAB. Prerequisite: EECS 212 and EECS Upper Level Eligibility.",
      "terms": [
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 368": {
    "4212": {
      "miniDesc": "EECS 368 Elect Engr & Computer Science - Programming Language Paradigms ( 3 )",
      "description": "The course is a survey of programming languages: their attributes, uses, advantages, and disadvantages. Topics include scopes, parameter passing, storage management, control flow, exception handling, encapsulation and modularization mechanism, reusability through genericity and inheritance, and type systems. In particular, several different languages will be studied which exemplify different language philosophies (e.g., procedural, functional, object-oriented, logic, scripting). Prerequisite: EECS 268 and upper-level EECS eligibility.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 388": {
    "4212": {
      "miniDesc": "EECS 388 Elect Engr & Computer Science - Embedded Systems ( 4 )",
      "description": "This course will address internal organization of micro-controller systems, sometimes called embedded systems, used in a wide variety of engineered systems: programming in C and assembly language; input and output systems; collecting data from sensors; and controlling external devices. This course will focus on one or two specific microprocessors, software development and organization, and building embedded systems. Prerequisite: EECS 140 or EECS 141, EECS 168 or EECS 169, and upper-level EECS eligibility.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 399": {
    "4212": {
      "miniDesc": "EECS 399 Elect Engr & Computer Science - Projects ( 1-5 )",
      "description": "An electrical engineering, computer engineering, or computer science project pursued under the student's initiative, culminating in a comprehensive report, with special emphasis on orderly preparation and effective composition. Prerequisite: Upper-level EECS eligibility and consent of instructor.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 412": {
    "4212": {
      "miniDesc": "EECS 412 Elect Engr & Computer Science - Electronic Circuits II ( 4 )",
      "description": "Discrete and integrated amplifier analysis and design. Introduction to feedback amplifier analysis and design. Introduction to feedback amplifiers. Prerequisite: EECS 312 and upper-level EECS eligibility.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 420": {
    "4219": {
      "miniDesc": "EECS 420 Elect Engr & Computer Science - Electromagnetics II ( 4 )",
      "description": "This course applies electromagnetic analysis to high frequency devices and systems where wave propagation effects cannot be neglected. Topics covered include transmission lines, space waves, waveguides, radiation, and antennas. Laboratory experiments include transmission line, waveguide, and antenna measurements and characterizations. 3 hours lecture, 1 hour laboratory. Prerequisite: EECS 220 and upper-level EECS eligibility.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 441": {
    "4212": {
      "miniDesc": "EECS 441 Elect Engr & Computer Science - Power Systems Engineering II ( 3 )",
      "description": "A continuation of ARCE 640 that integrates system components into functional, safe, and reliable power distribution systems for commercial, industrial, and institutional (CII) facilities. Service entrance design, distribution system layout and reliability, emergency and standby power system design, medium-voltage distribution systems, symmetrical fault analysis, and special equipment and occupancies. (Same as ARCE 641.) Prerequisite: ARCE 640 or EECS 212 and Upper-Level EECS Eligibility.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 443": {
    "4212": {
      "miniDesc": "EECS 443 Elect Engr & Computer Science - Digital Systems Design ( 4 )",
      "description": "The design of digital systems from a hardware point of view. The implementation of functional and control units using programmable logic devices. Introduction to VHDL and its use in modeling and designing digital systems. Prerequisite: EECS 388.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 444": {
    "4212": {
      "miniDesc": "EECS 444 Elect Engr & Computer Science - Control Systems ( 3 )",
      "description": "An introduction to the modeling, analysis, and design of linear control systems. Topics include mathematical models, feedback concepts, state-space methods, time response, system stability in the time and transform domains, design using PID control and series compensation, and digital controller implementation. Prerequisite: EECS 212 and EECS 360.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 447": {
    "4232": {
      "miniDesc": "EECS 447 Elect Engr & Computer Science - Introductn to Database Systems ( 3 )",
      "description": "Introduction to the concept of databases and their operations. Basic concepts, database architectures, storage structures and indexing, data structures: hierarchical, network, and relational database organizations. Database design and normalization: ER model, candidates keys, functional dependencies, normal forms, decomposition. Emphasis on relational databases, relational algebra, and SQL. Introduction to views, transactions, and database access control. Introduction to database security, big data, NoSQL, CAP theorem, key-value stores. Prerequisite: Upper-level EECS eligibility or departmental consent.",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 448": {
    "4212": {
      "miniDesc": "EECS 448 Elect Engr & Computer Science - Software Engineering I ( 4 )",
      "description": "This course is an introduction to software engineering, and it covers the systematic development of software products. It outlines the scope of software engineering, including life-cycle models, software process, teams, tools, testing, planning, and estimating. It concentrates on requirements, analysis, design, implementation, and maintenance of software products. The laboratory covers CASE tools, configuration control tools, UML diagrams, integrated development environments, and project specific components. Prerequisite: EECS 268 and upper-level EECS eligibility.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229"
      ]
    }
  },
  "EECS 461": {
    "4229": {
      "miniDesc": "EECS 461 Elect Engr & Computer Science - Probability and Statistics ( 3 )",
      "description": "Introduction to probability and statistics with applications. Reliability of systems. Discrete and continuous random variables. Expectations, functions of random variables, and linear regression. Sampling distributions, confidence intervals, and hypothesis testing. Joint, marginal, and conditional distribution and densities. Prerequisite: MATH 127 or MATH 147, and MATH 290 or MATH 291, and upper-level EECS eligibility.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 465": {
    "4212": {
      "miniDesc": "EECS 465 Elect Engr & Computer Science - Cyber Defense ( 3 )",
      "description": "An introduction to critical knowledge and skills needed to administer and defend computer networks and systems. This course focuses on hands-on activities, learning cybersecurity defensive techniques, and understanding well know techniques used by adversaries. Prerequisite: EECS 268. Corequisite: EECS 388.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 470": {
    "4219": {
      "miniDesc": "EECS 470 Elect Engr & Computer Science - Elctr Devices&Proprt of Matrls ( 3 )",
      "description": "An introduction to crystal structures, and metal, insulator, and semiconductor properties. Topics covered include the thermal, electric, dielectric, and optical properties of these materials. A significant portion of this course is devoted to the properties of semiconductors and semiconductor devices. Prerequisite: PHSX 313 and upper-level EECS eligibility.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 498": {
    "4212": {
      "miniDesc": "EECS 498 Elect Engr & Computer Science - Honors Research ( 1-2 / Honors )",
      "description": "Arranged to allow students to satisfy the independent research requirement for graduation with departmental honors. Prerequisite: Consent of instructor and upper-level EECS eligibility.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 501": {
    "4219": {
      "miniDesc": "EECS 501 Elect Engr & Computer Science - Senior Design Laboratory I ( 3 )",
      "description": "A lecture/laboratory course involving the design and implementation of prototypes of electrical and computer type products and systems. The project specifications require consideration of ethics, economics, manufacturing, and safety. Intended for students graduating the following calendar year. EECS 501 should be immediately followed by EECS 502 in the following semester. Prerequisite: EECS 221, EECS 360, and EECS 412.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 502": {
    "4212": {
      "miniDesc": "EECS 502 Elect Engr & Computer Science - Senior Design Laboratory II ( 3 / AE61 )",
      "description": "A lecture/laboratory course involving the design and implementation of prototypes of electrical and computer type products and systems. The project specifications require consideration of ethics, economics, health, manufacturing, and safety. Must be taken in semester immediately following completion of EECS 501. Prerequisite: EECS 501. Satisfies: Goal 6 Outcome 1 (AE61)",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 510": {
    "4212": {
      "miniDesc": "EECS 510 Elect Engr & Computer Science - Introdn to Theory of Computing ( 3 / N )",
      "description": "Finite state automata and regular expressions. Context-free grammars and pushdown automata. Turing machines. Models of computable functions and undecidable problems. The course emphasis is on the theory of computability, especially on showing limits of computation. (Same as MATH 510.) Prerequisite: EECS 210 and upper-level EECS eligibility. Satisfies: N Natural Science (N)",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 512": {
    "4222": {
      "miniDesc": "EECS 512 Elect Engr & Computer Science - Electronic Circuits III ( 3 )",
      "description": "Feedback amplifier circuit analysis, power amplifiers, analog IC op-amp techniques and analysis, filter approximation and realization, oscillators, wave generators and shapers. Prerequisite: EECS 412.",
      "terms": [
        "4222",
        "4232"
      ]
    }
  },
  "EECS 541": {
    "4219": {
      "miniDesc": "EECS 541 Elect Engr & Computer Science - Computer Systems Design Labr I ( 3 )",
      "description": "A two semester lecture/laboratory course involving the specification, design, implementation, analysis, and documentation of a significant hardware and software computer system. Laboratory work involves software, hardware, and hardware/software trade-offs. Project requirements include consideration of ethics, economics, manufacturing, safety, and health aspects of product development. Intended for students graduating the following calendar year. EECS 541 should be immediately followed by EECS 542 in the following semester. Prerequisite: EECS 443 and EECS 448.",
      "terms": [
        "4219"
      ]
    },
    "4229": {
      "miniDesc": "EECS 541 Elect Engr & Computer Science - Computer Systems Design Labr I ( 3 )",
      "description": "A two semester lecture/laboratory course involving the specification, design, implementation, analysis, and documentation of a significant hardware and software computer system. Laboratory work involves software, hardware, and hardware/software trade-offs. Project requirements include consideration of ethics, economics, manufacturing, safety, and health aspects of product development. Intended for students graduating the following calendar year. EECS 541 should be immediately followed by EECS 542 in the following semester. Prerequisite: EECS 443 and EECS 348.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 542": {
    "4212": {
      "miniDesc": "EECS 542 Elect Engr & Computer Science - Computer Systems Design Lab II ( 3 / AE61 )",
      "description": "A two semester lecture/laboratory course involving the specification, design, implementation, analysis, and documentation of a significant hardware and software computer system. Laboratory work involves software, hardware, and hardware/software trade-offs. Project requirements include consideration of ethics, economics, manufacturing, safety, and health aspects of product development. Must be taken in semester immediately following completion of EECS 541. Prerequisite: EECS 541. Satisfies: Goal 6 Outcome 1 (AE61)",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 545": {
    "4219": {
      "miniDesc": "EECS 545 Elect Engr & Computer Science - Electrc Energy Prductn&Storage ( 3 )",
      "description": "An introduction to the design of utility scale and small scale (distributed generation) electric energy production and storage systems. This course addresses the technical, operational, economic, and environmental characteristics associated with both traditional and nontraditional electric energy production systems along with associated grid integration, energy delivery, and regulatory issues. Traditional energy production systems covered include fossil fuel, hydroelectric, and nuclear power plants. Non-traditional energy productions systems covered include fuel cells, photovoltaics (PV), concentrated solar power (CSP), wind, geothermal, and other emerging technologies. (Same as ARCE 645.) Prerequisite: ARCE 640, or EECS 212 and Upper-Level EECS Eligibility.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 547": {
    "4219": {
      "miniDesc": "EECS 547 Elect Engr & Computer Science - Power System Analysis I ( 3 )",
      "description": "Introduction to the analysis of commercial, industrial, and utility power systems. Emphasis is placed on modeling system components which include transmission and distribution lines, transformers, induction machines, and synchronous machines and the development of a power system model for analysis from these components. System modeling will be applied to short-circuit studies and used to analyze symmetrical faults, to develop sequence networks using symmetrical components, and analyze unsymmetrical faults. (Same as ARCE 647.) Prerequisite: ARCE 640, or EECS 212 and Upper-Level EECS Eligibility.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 560": {
    "4212": {
      "miniDesc": "EECS 560 Elect Engr & Computer Science - Data Structures ( 4 )",
      "description": "Data abstraction and abstract data types. Topics include the design and implementation of dictionary, priority queues, concatenated queue, disjoint set structures, graphs, and other advanced data structures based on balanced and unbalanced tree structures. Special emphasis will be placed on the implementations of these structures and their performance tradeoffs. Both asymptotic complexity analysis and experimental profiling techniques will be introduced. Labs will be used to provide students with hands-on experience in the implementations of various abstract data types and to perform experimental performance analysis. Prerequisite: EECS 210 and EECS 448.",
      "terms": [
        "4212"
      ]
    },
    "4219": {
      "miniDesc": "EECS 560 Elect Engr & Computer Science - Data Structures ( 4 )",
      "description": "Data abstraction and abstract data types. Topics include the design and implementation of dictionary, priority queues, concatenated queue, disjoint set structures, graphs, and other advanced data structures based on balanced and unbalanced tree structures. Special emphasis will be placed on the implementations of these structures and their performance tradeoffs. Both asymptotic complexity analysis and experimental profiling techniques will be introduced. Labs will be used to provide students with hands-on experience in the implementations of various abstract data types and to perform experimental performance analysis. Prerequisite: EECS 210. Corequisite: EECS 448.",
      "terms": [
        "4219",
        "4222",
        "4229"
      ]
    }
  },
  "EECS 562": {
    "4212": {
      "miniDesc": "EECS 562 Elect Engr & Computer Science - Intro to Communication Systems ( 4 )",
      "description": "A first course in communications, including lectures and integrated laboratory experiments. After a review of spectral analysis and signal transmission, analog and digital communications are studied. Topics include: sampling, pulse amplitude modulation, and pulse code modulation; analog and digital amplitude, frequency, and phase modulation; frequency and time division multiplexing; and noise performance of analog modulation techniques. Prerequisite: EECS 212 and EECS 360.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 563": {
    "4219": {
      "miniDesc": "EECS 563 Elect Engr & Computer Science - Intr to Communication Networks ( 3 )",
      "description": "An introduction to the principles used in communication networks is given in this course. Topics include a discussion of the uses of communications networks, network traffic, network impairments, standards, layered reference models for organizing network functions. Local Area Network technology and protocols are discussed. Link, network, transport layer protocols, and security are introduced. TCP/IP networks are stressed. VoIP is used as an example throughout the course. Basic concepts of network performance evaluation are studied, both analytical and simulation techniques are considered. Prerequisite: EECS 168 and MATH 526 or EECS 461.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 565": {
    "4212": {
      "miniDesc": "EECS 565 Elect Engr & Computer Science - Intro Informatn&Cmptr Security ( 3 )",
      "description": "An introduction to the fundamentals of cryptography and information and computer security. Introduces the basic concepts, theories, and protocols in computer security. Discusses how to apply such knowledge to analyze, design and manage secure systems in the real world. Topic covered: the basics of cryptography, software security, operating system security, database security, network security, privacy and anonymity, social engineering, digital forensics, etc. Corequisite: EECS 678 and Prerequisite: Upper-Level EECS Eligibility.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 569": {
    "4219": {
      "miniDesc": "EECS 569 Elect Engr & Computer Science - Computer Forensics ( 3 )",
      "description": "This course covers both the theoretical and practical aspects of computer forensics. The course introduces the basic concepts, methodologies, and techniques to recover, preserve, and examine digital evidence on or transmitted by digital devices. Topics include: crime investigation and digital evidence, file system forensics, application analysis, network evidence acquisition and analysis, mobile device forensics, etc. Prerequisite: EECS 565.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 581": {
    "4219": {
      "miniDesc": "EECS 581 Elect Engr & Computer Science - Computer Science Design I ( 3 )",
      "description": "The background and planning phase of a two-semester, team-oriented lecture/laboratory course involving the specification, design, implementation, and documentation of a significant software system. The course includes the consideration of project management, ethics, economics, and technical writing. Intended for students graduating the following calendar year. EECS 581 should be immediately followed by EECS 582 in the following semester. Prerequisite: EECS 448. Corequsite: EECS 510 and EECS 560.",
      "terms": [
        "4219"
      ]
    },
    "4229": {
      "miniDesc": "EECS 581 Elect Engr & Computer Science - Software Engineering II ( 3 )",
      "description": "This lecture/laboratory course covers the systematic development of software products. Topics include: scope of software engineering, life-cycle models, software process, teams, ethics, tools, testing, planning, and estimating. It concentrates on requirements, analysis, design, implementation, and maintenance of software products. Prerequisite: EECS 348, EECS 330, EECS 468, and upper-level EECS eligibility. Corequisite: EECS 565.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 582": {
    "4212": {
      "miniDesc": "EECS 582 Elect Engr & Computer Science - Computer Science Design II ( 3 / AE61 )",
      "description": "The design and implementation phase of a two-semester, team-orientated lecture/laboratory course involving the specification, design, implementation, and documentation of a significant software system. The course includes the consideration of project management, ethics, economics, and technical writing. Must be taken in semester immediately following completion of EECS 581. Prerequisite: EECS 581. Satisfies: Goal 6 Outcome 1 (AE61)",
      "terms": [
        "4212",
        "4222"
      ]
    },
    "4232": {
      "miniDesc": "EECS 582 Elect Engr & Computer Science - Cmptr Sci&Intrdspnry Cmpt Cpst ( 3 / AE61 )",
      "description": "Team-orientated lecture/laboratory course involving the specification, design, implementation, testing, and documentation of a significant software project over the full course of the semester. The course includes the consideration of project management, economics, and technical writing. Prerequisite: EECS 581 and upper-level EECS eligibility. Satisfies: Goal 6 Outcome 1 (AE61)",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 611": {
    "4212": {
      "miniDesc": "EECS 611 Elect Engr & Computer Science - Electromagnetic Compatibility ( 3 )",
      "description": "A study of unwanted generation and reception of radio-frequency radiation from analog and digital electronic systems and how these emissions/receptions can be reduced. Topics covered include sources of radiation, grounding, shielding, crosstalk, electrostatic discharge, and practical design and layout schemes for reducing unwanted radiation and reception. Also covered are the major governmental electromagnetic compatibility (EMC) regulations and standards that apply to commercial electronic devices and systems. Prerequisite: EECS 220 and EECS 312.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 622": {
    "4219": {
      "miniDesc": "EECS 622 Elect Engr & Computer Science - Microwav&Radio Transmsn Systms ( 3 )",
      "description": "Introduction to radio transmission systems. Topics include radio transmitter and receiver design, radiowave propagation phenomenology, antenna performance and basic design, and signal detection in the presence of noise. Students will design radio systems to meet specified performance measure. Prerequisite: Corequisite: EECS 420 and MATH 526 or EECS 461.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 628": {
    "4212": {
      "miniDesc": "EECS 628 Elect Engr & Computer Science - Fiber Optic Communicatn Systms ( 3 )",
      "description": "Description and analysis of the key components in optical communication systems. Topics covered include quantum sources, fiber cable propagation and dispersion characteristics, receiver characteristics, and system gain considerations. Prerequisite: EECS 220 and PHSX 313 or equivalent and upper-level EECS eligibility.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 639": {
    "4219": {
      "miniDesc": "EECS 639 Elect Engr & Computer Science - Intro to Scientific Computing ( 3 )",
      "description": "A basic introduction to scientific computing and numerical analysis. Topics include linear equation solving, least squares, nonlinear equation-solving, optimization, interpolation, numerical integration and differentiation, ordinary differential equations, and the fast Fourier transform (FFT). Vectorization, efficiency, reliability, and stability of numerical algorithms will be stressed. Applications of algorithms to real-world problems, such as image processing, medicine, electronic circuits, flight trajectories, and molecular modeling, will be emphasized. Students cannot receive credit for both EECS 639 and EECS 781 or MATH 781. Prerequisite: MATH 127, MATH 290, and EECS 168 or equivalent.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 643": {
    "4229": {
      "miniDesc": "EECS 643 Elect Engr & Computer Science - Computer Architecture ( 3 )",
      "description": "The structure and design of computing systems. Examination and analysis of computing systems. Examination and analysis of instruction set architectures, pipelined control and arithmetic units, vector processors, memory hierarchies, and performance evaluation. Prerequisite: EECS 443.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 644": {
    "4219": {
      "miniDesc": "EECS 644 Elect Engr & Computer Science - Intr Digital Signal Processing ( 3 )",
      "description": "Discrete time signal and systems theory, sampling theorem, z-transforms, digital filter design, discrete Fourier transform, FFT, and hardware considerations. Prerequisite: EECS 360.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 645": {
    "4212": {
      "miniDesc": "EECS 645 Elect Engr & Computer Science - Computer Architecture ( 3 )",
      "description": "The structure, design, analysis, and evaluation of computer processors and systems. The design of instruction sets. Principles and techniques of parallelism at the data transfer (memory hierarchy), data processing (pipelines), and concurrent instruction execution. Prerequisite: EECS 388.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 647": {
    "4212": {
      "miniDesc": "EECS 647 Elect Engr & Computer Science - Introductn to Database Systems ( 3 )",
      "description": "Introduction to the concept of databases and their operations. Basic concepts, database architectures, storage structures and indexing, data structures: hierarchical, network, and relational database organizations. Emphasis on relational databases and retrieval languages SQL, QBE, and ones based on relational algebra and relational calculus; brief description of predicate calculus. Theory of databases, normal forms, normalization, candidates keys, decomposition, functional dependencies, multi-valued dependencies. Introduction to the design of a simple database structure and a data retrieval language. Student cannot receive credit for both EECS 647 and EECS 746. Prerequisite: EECS 448.",
      "terms": [
        "4212",
        "4222"
      ]
    }
  },
  "EECS 649": {
    "4212": {
      "miniDesc": "EECS 649 Elect Engr & Computer Science - Intr to Artificial Intelligenc ( 3 )",
      "description": "General concepts, search procedures, two-person games, predicate calculus and automated theorem proving, nonmonotonic logic, probabilistic reasoning, rule based systems, semantic networks, frames, dynamic memory, planning, machine learning, natural language understanding, neural networks. Prerequisite: Corequisite: EECS 368.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 658": {
    "4219": {
      "miniDesc": "EECS 658 Elect Engr & Computer Science - Intro to Machine Learning ( 3 )",
      "description": "This course provides an introduction to the basic methods of machine learning and how to apply them to solve software engineering problems. Topics covered are: supervised learning, unsupervised learning, and reinforcement learning methods; feature selection techniques; structuring machine learning solutions; and evaluation metrics. Prerequisite: EECS 448.",
      "terms": [
        "4219"
      ]
    },
    "4229": {
      "miniDesc": "EECS 658 Elect Engr & Computer Science - Intro to Machine Learning ( 3 )",
      "description": "This course provides an introduction to the basic methods of machine learning and how to apply them to solve software engineering problems. Topics covered are: supervised learning, unsupervised learning, and reinforcement learning methods; feature selection techniques; structuring machine learning solutions; and evaluation metrics. Prerequisite: EECS 348 and upper-level EECS eligibility.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 660": {
    "4212": {
      "miniDesc": "EECS 660 Elect Engr & Computer Science - Fndmntls of Computer Algorthms ( 3 )",
      "description": "Basic concepts and techniques in the design and analysis of computer algorithms. Models of computations. Simple lower bound theory and optimality of algorithms. Computationally hard problems and the theory of NP-Completeness. Introduction to parallel algorithms. Prerequisite: EECS 560 and either EECS 461 or MATH 526.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 662": {
    "4212": {
      "miniDesc": "EECS 662 Elect Engr & Computer Science - Programming Languages ( 3 )",
      "description": "Formal definition of programming languages including specification of syntax and semantics. Simple statements including precedence, infix, prefix, and postfix notation. Global properties of algorithmic languages including scope of declaration, storage allocation, grouping of statements, binding time of constituents, subroutines, coroutines, and tasks. Run-time representation of program and data structures. Prerequisite: EECS 368 and EECS 560.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 665": {
    "4212": {
      "miniDesc": "EECS 665 Elect Engr & Computer Science - Compiler Construction ( 4 )",
      "description": "Compilation of simple expressions and statements. Organization of a compiler including symbol tables, lexical analysis, syntax analysis, intermediate and object code generation, error diagnostics, code optimization techniques and run-time structures in a block-structured language such as PASCAL or C. Programming assignments include using tools for lexer and parser generator, and intermediate , and object code generation techniques. Laboratory exercises will provide hands-on experience with the tools and concepts required for the programming assignments. Prerequisite: EECS 368, EECS 448, and EECS 510.",
      "terms": [
        "4212",
        "4219",
        "4222"
      ]
    },
    "4229": {
      "miniDesc": "EECS 665 Elect Engr & Computer Science - Compiler Construction ( 4 )",
      "description": "Compilation of programming language constructs. Organization of a compiler including symbol tables, lexical analysis, syntax analysis, intermediate and object code generation, error diagnostics, code optimization techniques and run-time structures in a block-structured language such as C or Rust. Programming assignments include construction of various modules of a compiler. Prerequisite: EECS 348, EECS 468, EECS 510, and upper-level eligibility.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 670": {
    "4212": {
      "miniDesc": "EECS 670 Elect Engr & Computer Science - Intro Semiconductor Processing ( 3 )",
      "description": "An overview of various processes to fabricate semiconductor devices and integrated circuits. Topics covered include crystal growth, oxidation, solid-state diffusion, ion implantation, photolithography, chemical vapor deposition, epitaxial growth, metalization, and plasma etching of thin films. (Same as C&PE 655.) Prerequisite: Senior standing in C&PE or EECS, or consent of instructor.",
      "terms": [
        "4212"
      ]
    }
  },
  "EECS 678": {
    "4212": {
      "miniDesc": "EECS 678 Elect Engr & Computer Science - Introdctn to Operating Systems ( 4 )",
      "description": "The objective of this course is to provide the students with the concepts necessary to enable them to: a) identify the abstract services common to all operating system, b) define the basic system components that support the operating system's machine independent abstractions on particular target architectures, c) consider how the design and implementation of different systems components interact and constrain one another, not merely how one or two important parts work in isolation, and d) understand the means by which fundamental problems in operating systems can be analyzed and addressed. Programming assignments address topics including process creation, inter-process communication, system call implementation, process scheduling and virtual memory. Laboratory exercises primarily focus on use of tools and concepts required for the programming assignments but include a small number of independent topics. Prerequisite: EECS 388 and EECS 448.",
      "terms": [
        "4212",
        "4219",
        "4222"
      ]
    },
    "4229": {
      "miniDesc": "EECS 678 Elect Engr & Computer Science - Introdctn to Operating Systems ( 4 )",
      "description": "The objective of this course is to provide the students with the concepts necessary to enable them to: a) identify the abstract services common to all operating system, b) define the basic system components that support the operating system's machine independent abstractions on particular target architectures, c) consider how the design and implementation of different systems components interact and constrain one another, not merely how one or two important parts work in isolation, and d) understand the means by which fundamental problems in operating systems can be analyzed and addressed. Programming assignments address topics including process creation, inter-process communication, system call implementation, process scheduling and virtual memory. Laboratory exercises primarily focus on use of tools and concepts required for the programming assignments but include a small number of independent topics. Prerequisite: EECS 388, EECS 348, and upper-level EECS eligibility.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 690": {
    "4212": {
      "miniDesc": "EECS 690 Elect Engr & Computer Science - Special Topics: ( 1-3 )",
      "description": "Arranged as needed to present appropriate material to groups of students. May be repeated for additional credit. Prerequisite: Varies by topic, plus Upper-level EECS eligibility and consent of instructor.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 692": {
    "4212": {
      "miniDesc": "EECS 692 Elect Engr & Computer Science - Directed Reading ( 1-3 )",
      "description": "Reading under the supervision of an instructor on a topic chosen by the student with the advice of the instructor. May be repeated for additional credit. Consent of the department required for enrollment. Prerequisite: Upper-level EECS eligibility and consent of instructor.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 700": {
    "4212": {
      "miniDesc": "EECS 700 Elect Engr & Computer Science - Special Topics: ( 1-5 )",
      "description": "Courses on special topics of current interest in electrical engineering, computer engineering, or computer science, given as the need arises. May be repeated for additional credit. Prerequisite: Varies by topic.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 713": {
    "4219": {
      "miniDesc": "EECS 713 Elect Engr & Computer Science - High-Speed Digital Circuit Dsn ( 3 )",
      "description": "Basic concepts and techniques in the design and analysis of high-frequency digital and analog circuits. Topics include: transmission lines, ground and power planes, layer stacking, substrate materials, terminations, vias, component issues, clock distribution, cross-talk, filtering and decoupling, shielding, signal launching. Prerequisite: EECS 312 and senior or graduate standing. EECS 420 recommended.",
      "terms": [
        "4219"
      ]
    }
  },
  "EECS 721": {
    "4212": {
      "miniDesc": "EECS 721 Elect Engr & Computer Science - Antennas ( 3 )",
      "description": "Gain, Pattern, and Impedance concepts for antennas. Linear, loop, helical, and aperture antennas (arrays, reflectors, and lenses). Cylindrical and biconical antenna theory. Prerequisite: EECS 360 and EECS 420, or EECS 720, or permission of the instructor.",
      "terms": [
        "4212",
        "4232"
      ]
    }
  },
  "EECS 723": {
    "4219": {
      "miniDesc": "EECS 723 Elect Engr & Computer Science - Microwave Engineering ( 3 )",
      "description": "Survey of microwave systems, techniques, and hardware. Guided-wave theory, microwave network theory, active and passive microwave components. Prerequisite: EECS 420.",
      "terms": [
        "4219",
        "4222",
        "4226"
      ]
    }
  },
  "EECS 725": {
    "4212": {
      "miniDesc": "EECS 725 Elect Engr & Computer Science - Introduction to Radar Systems ( 3 )",
      "description": "Basic radar principles and applications. Radar range equation. Pulsed and CW modes of operation for detection, ranging, and extracting Doppler information. Prerequisite: EECS 360, EECS 420, EECS 461 or MATH 526. EECS 622 recommended.",
      "terms": [
        "4212",
        "4229"
      ]
    }
  },
  "EECS 727": {
    "4222": {
      "miniDesc": "EECS 727 Elect Engr & Computer Science - Photonics ( 3 )",
      "description": "The course presents the theory and the design principles of photonic systems. Topics include: Light propagation, interference, and diffraction, permittivity models and effective media, electromagnetic propagation in complex media, dispersion engineering, and fundamentals of nonlinear optics. Prerequisite: EECS 420 or equivalent.",
      "terms": [
        "4222"
      ]
    }
  },
  "EECS 728": {
    "4229": {
      "miniDesc": "EECS 728 Elect Engr & Computer Science - Fiber-optic Measuremnt&Sensors ( 3 )",
      "description": "The course will focus on fundamental theory and various methods and applications of fiber-optic measurements and sensors. Topics include: optical power and loss measurements, optical spectrum analysis, wavelength measurements, polarization measurements, dispersion measurements, PMD measurements, optical amplifier characterization, OTDR, optical components characterization and industrial applications of fiber-optic sensors. Prerequisite: EECS 628 or equivalent.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 730": {
    "4212": {
      "miniDesc": "EECS 730 Elect Engr & Computer Science - Introduction to Bioinformatics ( 3 )",
      "description": "This course provides an introduction to bioinformatics. It covers computational tools and databases widely used in bioinformatics. The underlying algorithms of existing tools will be discussed. Topics include: molecular biology databases, sequence alignment, gene expression data analysis, protein structure and function, protein analysis, and proteomics. Prerequisite: Data Structures class equivalent to EECS 560, and Introduction to Biology equivalent to BIOL 150, or consent of instructor.",
      "terms": [
        "4212"
      ]
    },
    "4232": {
      "miniDesc": "EECS 730 Elect Engr & Computer Science - Introduction to Bioinformatics ( 3 )",
      "description": "This course provides an introduction to bioinformatics. It covers computational tools and databases widely used in bioinformatics. The underlying algorithms of existing tools will be discussed. Topics include: molecular biology databases, sequence alignment, gene expression data analysis, protein structure and function, protein analysis, and proteomics. Prerequisite: Data Structures class equivalent to EECS 330, and Introduction to Biology equivalent to BIOL 150, or consent of instructor.",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 731": {
    "4222": {
      "miniDesc": "EECS 731 Elect Engr & Computer Science - Introduction to Data Science ( 3 )",
      "description": "This course covers topics in data collection, data transmission, and data analysis, in support of discoveries and innovations based on massive amounts of data. EECS 731 surveys current topics in data science. It provides a comprehensive review of theory, algorithms, and tools that are used in data science and prepares students to take in-depth following up courses in EECS. EECS 731 is a project-oriented course. It offers hands-on experience for students to integrate knowledge from a wide-range of topics in data science without dwelling on any particular subfield of data science. Prerequisite: EECS 268 or experience with object oriented programming and large programs. MATH 290 or experience with linear algebra. EECS 461 or MATH 526 or experience with probability and statistics. Or consent from the instructor.",
      "terms": [
        "4222",
        "4229"
      ]
    }
  },
  "EECS 738": {
    "4212": {
      "miniDesc": "EECS 738 Elect Engr & Computer Science - Machine Learning ( 3 )",
      "description": "\"Machine learning is the study of computer algorithms that improve automatically through experience\" (Tom Mitchell). This course introduces basic concepts and algorithms in machine learning. A variety of topics such as Bayesian decision theory, dimensionality reduction, clustering, neural networks, hidden Markov models, combining multiple learners, reinforcement learning, Bayesian learning etc. will be covered. Prerequisite: Graduate standing in CS or CoE or consent of instructor.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 739": {
    "4212": {
      "miniDesc": "EECS 739 Elect Engr & Computer Science - Parallel Scientific Computing ( 3 )",
      "description": "This course is concerned with the application of parallel processing to real-world problems in engineering and the sciences. State-of-the-art serial and parallel numerical computing algorithms are studied along with contemporary applications. The course takes an algorithmic design, analysis, and implementation approach and covers an introduction to scientific and parallel computing, parallel computing platforms, design principles of parallel algorithms, analytical modeling of parallel algorithms, MPI programming, direct and iterative linear solvers, numerical PDEs and meshes, numerical optimization, GPU computing, and applications of parallel scientific computing. Prerequisite: MATH 126, MATH 290, experience programming in C, C++, or Fortran; EECS 639 (or equivalent.) Highly recommended: MATH 127.",
      "terms": [
        "4212",
        "4232"
      ]
    }
  },
  "EECS 741": {
    "4232": {
      "miniDesc": "EECS 741 Elect Engr & Computer Science - Computer Vision ( 3 )",
      "description": "This course gives a hands-on introduction to the fundamentals and applications of computer vision. Topics include: Image processing fundamentals, feature detection and matching, projective geometry and transformation, camera geometry and calibration, two-view geometry and stereo vision, structure from motion, parameter estimation and optimization, and the latest developments and applications in computer vision. Prerequisite: MATH 290 and MATH 526, or consent from the instructor.",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 743": {
    "4222": {
      "miniDesc": "EECS 743 Elect Engr & Computer Science - Advanced Computer Architecture ( 3 )",
      "description": "Topics of this course will be divided into three main categories: (a) theory of parallelism, (b) hardware technologies, and (c) parallel and scalable architectures. For example, principles of performance and scalability, processors and memory hierarchy, linear/nonlinear pipelining and superscalar techniques, and scalable multiprocessors and dataflow architectures will be among the topics to be covered. The course will also focus on emerging and heterogeneous architectures and their performance potential and programming models. For example, reconfigurable computing (RC), quantum computing (QC), and neuromorphic computing (NC) will be covered in some details. This would be achieved through practical experiments, and homework projects using realistic workloads on some state-of- the-art high-performance reconfigurable and quantum computers. Finally, students will select published related research work for discussions and oral presentations. Prerequisite: EECS 643 or EECS 645, or equivalent. A good understanding of C/C++ and having basic Unix/Linux skills is required.",
      "terms": [
        "4222",
        "4232"
      ]
    }
  },
  "EECS 744": {
    "4229": {
      "miniDesc": "EECS 744 Elect Engr & Computer Science - Cmmunctn&Radr Dgtl Signl Procs ( 3 )",
      "description": "The application of DSP techniques to specialized communications and radar signal processing subsystems. Topics include A-D converters, specialized digital filters, software receiver systems, adaptive subsystems and timing. Prerequisite: An undergraduate course in DSP such as EECS 644.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 750": {
    "4219": {
      "miniDesc": "EECS 750 Elect Engr & Computer Science - Advanced Operating Systems ( 3 )",
      "description": "In this course, we will study advanced topics in operating systems for modern hardware platforms. The topics include: multicore CPU scheduling, cache and DRAM management, flash-based storage systems and I/O management, power/energy management, and cloud systems. We will discuss classical and recent papers in each of these topics. We will also study advanced resource management capabilities in recent Linux kernels. The course will consist of lectures, student presentations, and a term project. Prerequisite: EECS 678.",
      "terms": [
        "4219"
      ]
    }
  },
  "EECS 753": {
    "4212": {
      "miniDesc": "EECS 753 Elect Engr & Computer Science - Embd&Real Time Computer Systms ( 3 )",
      "description": "This course will cover emerging and proposed techniques and issues in embedded and real time computer systems. Topics will include new paradigms, enabling technologies, and challenges resulting from emerging application domains. Prerequisite: EECS 645 and EECS 678.",
      "terms": [
        "4212",
        "4222"
      ]
    }
  },
  "EECS 755": {
    "4222": {
      "miniDesc": "EECS 755 Elect Engr & Computer Science - Software Modeling and Analysis ( 3 )",
      "description": "Modern techniques for modeling and analyzing software systems. Course coverage concentrates on pragmatic, formal modeling techniques that support predictive analysis. Topics include formal modeling, static analysis, and formal analysis using model checking and theorem proving systems. Prerequisite: EECS 368 or equivalent.",
      "terms": [
        "4222"
      ]
    }
  },
  "EECS 759": {
    "4212": {
      "miniDesc": "EECS 759 Elect Engr & Computer Science - Estimation and Control of UAS ( 3 )",
      "description": "An introduction to the modeling, estimation, and control of unmanned autonomous systems. Topics include motion description, navigation sensors, complementary filters, Kalman filters, attitude estimation, position estimation, attitude keeping controller, etc. The successful completion of this course will prepare students for advanced studies in robotics & controls. (Same as AE 759.) Prerequisite: MATH 627, AE 551 or AE 552 or EECS 444, or by consent of instructor.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 762": {
    "4212": {
      "miniDesc": "EECS 762 Elect Engr & Computer Science - Programming Languag Foundatn I ( 3 )",
      "description": "This course presents a basic introduction to the semantics of programming languages. The presentation begins with basic lambda calculus and mechanisms for evaluating lambda calculus terms. Types are introduced in the form of simply typed lambda calculus and techniques for type inference and defining type systems are presented. Finally, techniques for using lambda calculus to define, evaluate and type check common programming language constructs are presented. Prerequisite: EECS 662 or equivalent.",
      "terms": [
        "4212",
        "4232"
      ]
    }
  },
  "EECS 764": {
    "4222": {
      "miniDesc": "EECS 764 Elect Engr & Computer Science - Analysis of Algorithms ( 3 )",
      "description": "Models of computations and performance measures; asymptotic analysis of algorithms; basic design paradigms including divide-and-conquer, dynamic programming, backtracking, branch-and-bound, greedy method and heuristics; design and analysis of approximation algorithms; lower bound theory; polynomial transformation and the theory of NP-Completeness; additional topics may be selected from arithmetic complexity, graph algorithms, string matching, and other combinatorial problems. Prerequisite: EECS 660 or equivalent.",
      "terms": [
        "4222"
      ]
    }
  },
  "EECS 765": {
    "4219": {
      "miniDesc": "EECS 765 Elect Engr & Computer Science - Intro Cryptgrphy&Cmptr Securty ( 3 )",
      "description": "Comprehensive coverage to the fundamentals of cryptography and computer and communication security. This course serves as the first graduate level security course, which introduces the core concepts, theories, algorithms and protocols in computer and communication security, and also prepares students for advanced security courses. This course first covers the mathematical foundation of cryptography and its applications in computer security. The course also covers a wide range of topics: information and database security, software and computer systems security, network security, Internet and web security. Prerequisite: EECS 678 and EECS 563 or EECS 780, or the instructor's approval.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 767": {
    "4222": {
      "miniDesc": "EECS 767 Elect Engr & Computer Science - Information Retrieval ( 3 )",
      "description": "This class introduces algorithms and applications for retrieving information from large document repositories, including the Web. Topics span from classic information retrieval methods for text documents and databases, to recent developments in Web search, including: text algorithms, indexing, probabilistic modeling, performance evaluation, web structures, link analysis, multimedia information retrieval, social network analysis. Prerequisite: EECS 647 or permission of instructor.",
      "terms": [
        "4222"
      ]
    },
    "4232": {
      "miniDesc": "EECS 767 Elect Engr & Computer Science - Information Retrieval ( 3 )",
      "description": "This class introduces algorithms and applications for retrieving information from large document repositories, including the Web. Topics span from classic information retrieval methods for text documents and databases, to recent developments in Web search, including: text algorithms, indexing, probabilistic modeling, performance evaluation, web structures, link analysis, multimedia information retrieval, social network analysis. Prerequisite: EECS 447 or permission of instructor.",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 768": {
    "4212": {
      "miniDesc": "EECS 768 Elect Engr & Computer Science - Virtual Machines ( 3 )",
      "description": "Understand the fundamental principles and advanced implementation aspects of key virtual machine concepts. Topics include principles of virtualization, binary translation, process and system level virtual machines, JIT complication and optimizations in managed environments, garbage collection, virtual machine implementation issues, and virtual machine security. Includes in-depth coverage of the latest developments and research issues in the filed of virtual machines. Prerequisite: EECS 665 and either EECS 643 or EECS 645 or consent of instructor.",
      "terms": [
        "4212"
      ]
    }
  },
  "EECS 769": {
    "4219": {
      "miniDesc": "EECS 769 Elect Engr & Computer Science - Information Theory ( 3 )",
      "description": "Information theory is the science of operations on data such as compression, storage, and communication. It is one of the few scientific fields fortunate enough to have an identifiable beginning - Claude Shannon's 1948 paper. The main topics of mutual information, entropy, and relative entropy are essential for students, researchers, and practitioners in such diverse fields as communications, data compression, statistical signal processing, neuroscience, and machine learning. The topics covered in this course include mathematical definitions and properties of information, mutual information, source coding theorem, lossless compression of data, optimal lossless coding, noisy communication channels, channel coding theorem, the source channel separation theorem, multiple access channels, broadcast channels, Gaussian noise, time-varying channels, and network information theory. Prerequisite: EECS 461 or MATH 526 or an equivalent undergraduate probability course.",
      "terms": [
        "4219"
      ]
    }
  },
  "EECS 780": {
    "4219": {
      "miniDesc": "EECS 780 Elect Engr & Computer Science - Communication Networks ( 3 )",
      "description": "Comprehensive in-depth coverage to communication networks with emphasis on the Internet and the PSTN (wired and wireless, and IoT-Internet of Things). Extensive coverage of protocols and algorithms will be presented at all levels, including: social networking, overlay networks, client/server and peer-to-peer applications; session control; transport protocols, the end-to-end arguments and end-to-end congestion control; network architecture, forwarding, routing, signaling, addressing, and traffic management, programmable and software-defined networks (SDN); quality of service, queuing and multimedia applications; LAN architecture, link protocols, access networks and MAC algorithms; physical media characteristics and coding; network security and information assurance; network management. (Same as IT 780.) Prerequisite: EECS 563 or equivalent or permission of instructor.",
      "terms": [
        "4219"
      ]
    }
  },
  "EECS 781": {
    "4219": {
      "miniDesc": "EECS 781 Elect Engr & Computer Science - Numerical Analysis I ( 3 )",
      "description": "Finite and divided differences. Interpolation, numerical differentiation, and integration. Gaussian quadrature. Numerical integration of ordinary differential equations. Curve fitting. (Same as MATH 781.) Prerequisite: MATH 320 and knowledge of a programming language.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 782": {
    "4212": {
      "miniDesc": "EECS 782 Elect Engr & Computer Science - Numerical Analysis II ( 3 )",
      "description": "Direct and interactive methods for solving systems of linear equations. Numerical solution of partial differential equations. Numerical determination of eigenvectors and eigenvalues. Solution of nonlinear equations. (Same as MATH 782.) Prerequisite: EECS 781 or MATH 781.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 800": {
    "4212": {
      "miniDesc": "EECS 800 Elect Engr & Computer Science - Special Topics: ( 1-5 )",
      "description": "Advanced courses on special topics of current interest in electrical engineering, computer engineering, or computer science, given as the need arises. May be repeated for additional credit. Prerequisite: Varies by topic.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 801": {
    "4212": {
      "miniDesc": "EECS 801 Elect Engr & Computer Science - Directed Graduate Readings ( 1-3 )",
      "description": "Graduate level directed readings on a topic in electrical engineering, computer engineering, or computer science, mutually agreed-on by the student and instructor. May be repeated for credit on another topic. Prerequisite: Consent of instructor.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 802": {
    "4212": {
      "miniDesc": "EECS 802 Elect Engr & Computer Science - EECS Colqm&Sem Profsnl Issues ( 1 )",
      "description": "A colloquium/seminar series in which presentation are provided on a broad variety of scholarly and professional topics. Topics related to the issues of responsible scholarship in the fields of computing and electrical engineering will be discussed. Student are also required to attend a series of colloquia and submit written reports. Course will be graded Satisfactory/Fail and is required for all EECS graduate students. Prerequisite: Graduate standing in the EECS Department.",
      "terms": [
        "4212",
        "4219",
        "4222",
        "4229",
        "4232"
      ]
    }
  },
  "EECS 812": {
    "4226": {
      "miniDesc": "EECS 812 Elect Engr & Computer Science - Software Requirmts Engineering ( 3 )",
      "description": "Objectives, processes, and activities of requirements engineering and requirements management; characteristics of good requirements; types of requirements; managing changing requirements; languages, notations, and methodologies; formal and semi-formal methods of presenting and validating the requirements; requirements standards; traceability issues. Prerequisite: EECS 810.",
      "terms": [
        "4226"
      ]
    }
  },
  "EECS 820": {
    "4212": {
      "miniDesc": "EECS 820 Elect Engr & Computer Science - Advanced Electromagnetics ( 3 )",
      "description": "A theorem-based approach to solving Maxwell's equations for modeling electromagnetic problems encountered in microwave systems, antennas, scattering. Topics include waves, source modeling, Schelkunoff equivalence principle, scattered filed formulations, electromagnetic induction, reciprocity principles, Babinet's principle, and construction of solutions in various coordinate systems. Prerequisite: EECS 420.",
      "terms": [
        "4212",
        "4232"
      ]
    }
  },
  "EECS 823": {
    "4232": {
      "miniDesc": "EECS 823 Elect Engr & Computer Science - Microwave Remote Sensing ( 3 )",
      "description": "Description and analysis of basic microwave remote sensing systems including radars and radiometers as well as the scattering and emission properties of natural targets. Topics covered include plane wave propagation, antennas, radiometers, atmospheric effects, radars, calibrated systems, and remote sensing applications. Prerequisite: EECS 420 and EECS 622.",
      "terms": [
        "4232"
      ]
    }
  },
  "EECS 843": {
    "4229": {
      "miniDesc": "EECS 843 Elect Engr & Computer Science - Programng Language Foundatn II ( 3 )",
      "description": "This course presents advanced topics in programming language semantics. Fixed point types are presented followed by classes of polymorphism and their semantics. System F and type variables are presented along with universal and existential types. The lambda cube is introduced along with advanced forms of polymorphism. Several interpreters are developed implementing various type systems and associated type inference algorithms. Prerequisite: EECS 762.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 844": {
    "4212": {
      "miniDesc": "EECS 844 Elect Engr & Computer Science - Adaptive Signal Processing ( 3 )",
      "description": "This course presents the theory and application of adaptive signal processing. Topics include adaptive filtering, mathematics for advanced signal processing, cost function modeling and optimization, signal processing algorithms for optimum filtering, array processing, linear prediction, interference cancellation, power spectrum estimation, steepest descent, and iterative algorithms. Prerequisite: Background in fundamental signal processing (such as EECS 644.) Corequisite: EECS 861.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 861": {
    "4219": {
      "miniDesc": "EECS 861 Elect Engr & Computer Science - Random Signals and Noise ( 3 )",
      "description": "Fundamental concepts in random variables, random process models, power spectral density. Application of random process models in the analysis and design of signal processing systems, communication systems and networks. Emphasis on signal detection, estimation, and analysis of queues. This course is a prerequisite for most of the graduate level courses in radar signal processing, communication systems and networks. Prerequisite: An undergraduate course in probability and statistics, and signal processing.",
      "terms": [
        "4219",
        "4229"
      ]
    }
  },
  "EECS 862": {
    "4212": {
      "miniDesc": "EECS 862 Elect Engr & Computer Science - Prin Digital Communcatn Systms ( 3 )",
      "description": "A study of communication systems using noisy channels. Principal topics are: information and channel capacity, baseband data transmission, digital carrier modulation, error control coding, and digital transmission of analog signals. The course includes a laboratory/computer aided design component integrated into the study of digital communication systems. Prerequisite: EECS 562. Corequisite: EECS 861.",
      "terms": [
        "4212",
        "4232"
      ]
    }
  },
  "EECS 863": {
    "4222": {
      "miniDesc": "EECS 863 Elect Engr & Computer Science - Netwrk Anlys,Simultn&Measrmnts ( 3 )",
      "description": "Prediction of communication network performance using analysis, simulation, and measurement. Topics include: an introduction to queueing theory, application of theory to prediction of communication network and protocol performance, and analysis of scheduling mechanisms. Modeling communication networks using analytic and simulation approaches, model verification and validation through analysis and measurement, and deriving statistically significant results. Analysis, simulation, and measurement tools will be discussed. Prerequisite: EECS 461 or MATH 526, and EECS 563 or EECS 780.",
      "terms": [
        "4222"
      ]
    }
  },
  "EECS 865": {
    "4222": {
      "miniDesc": "EECS 865 Elect Engr & Computer Science - Wireless Communication Systems ( 3 )",
      "description": "The theory and practice of the engineering of wireless telecommunication systems. Topics include cellular principles, mobile radio propagation (including indoor and outdoor channels), radio link calculations, fading (including Rayleigh, Rician, and other models), packet radio, equalization, diversity, error correction coding, spread spectrum, multiple access techniques (including time, frequency, and code), and wireless networking. Current topics of interest will be covered. Prerequisite: Corequisite: EECS 861.",
      "terms": [
        "4222"
      ]
    }
  },
  "EECS 866": {
    "4212": {
      "miniDesc": "EECS 866 Elect Engr & Computer Science - Network Security ( 3 )",
      "description": "This course provides in-depth coverage on the concepts, principles, and mechanisms in network security and secure distributed systems. The topics that will be covered include: network security primitives, risks and vulnerabilities, authentication, key management, network attacks and defense, secure communication protocols, intrusion detection, exploit defenses, traffic monitoring and analysis, and privacy mechanisms. Prerequisite: EECS 765 and EECS 563 or EECS 780, or the instructor's approval.",
      "terms": [
        "4212",
        "4219",
        "4229"
      ]
    }
  },
  "EECS 868": {
    "4212": {
      "miniDesc": "EECS 868 Elect Engr & Computer Science - Math Optmztn w/ Applicatns ( 3 )",
      "description": "A mathematical study of the minimization of functions. The course provides an introduction to the mathematical theory, implementation, and application of a variety of optimization techniques, with an emphasis on real-world applications. Optimization problem formulation. Unconstrained and constrained minimization, including conditions for optimality. Specific techniques for solving linear and nonlinear programming problems. Convergence of algorithms. Prerequisite: MATH 590 or EECS 639, or the consent of the instructor.",
      "terms": [
        "4212",
        "4222",
        "4232"
      ]
    }
  },
  "EECS 869": {
    "4229": {
      "miniDesc": "EECS 869 Elect Engr & Computer Science - Error Control Coding ( 3 )",
      "description": "A study of communication channels and the coding problem. An introduction to finite fields and linear block codes such as cyclic, Hamming, Golay, BCH, and Reed-Solomon. Convolutional codes and the Viberbi algorithm are also covered. Other topics include trellis coded modulation, iterative (turbo) codes, LDPC codes. Prerequisite: EECS: 562 or equivalent.",
      "terms": [
        "4229"
      ]
    }
  },
  "EECS 891": {
    "4212": {
      "miniDesc": "EECS 891 Elect Engr & Computer Science - Graduate Problems ( 1-5 )",
      "description": "Directed studies of advanced phases of electrical engineering, computer engineering, computer science or information technology not covered in regular graduate courses, including advanced laboratory work, special research, or library reading. Prerequisite: Consent of instructor.",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226"
      ]
    },
    "4229": {
      "miniDesc": "EECS 891 Elect Engr & Computer Science - Graduate Problems ( 1-5 )",
      "description": "Directed studies of advanced phases of electrical engineering, computer engineering, computer science or information technology not covered in regular graduate courses, including advanced laboratory work, special research, or library reading. Graded on a satisfactory progress/limited progress/no progress basis. Prerequisite: Consent of instructor.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 899": {
    "4212": {
      "miniDesc": "EECS 899 Elect Engr & Computer Science - Master's Thesis or Report ( 1-6 )",
      "description": "",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226"
      ]
    },
    "4229": {
      "miniDesc": "EECS 899 Elect Engr & Computer Science - Master's Thesis or Report ( 1-6 )",
      "description": "Graded on a satisfactory progress/limited progress/no progress basis.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 965": {
    "4219": {
      "miniDesc": "EECS 965 Elect Engr & Computer Science - Detection & Estimation Theory ( 3 )",
      "description": "Detection of signals in the presence of noise and estimation of signal parameters. Narrowband signals, multiple observations, signal detectability and sequential detection. Theoretical structure and performance of the receiver. Prerequisite: EECS 861.",
      "terms": [
        "4219"
      ]
    }
  },
  "EECS 998": {
    "4212": {
      "miniDesc": "EECS 998 Elect Engr & Computer Science - Post-Master's Research ( 1-6 )",
      "description": "",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226"
      ]
    },
    "4229": {
      "miniDesc": "EECS 998 Elect Engr & Computer Science - Post-Master's Research ( 1-6 )",
      "description": "Graded on a satisfactory progress/limited progress/no progress basis.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  },
  "EECS 999": {
    "4212": {
      "miniDesc": "EECS 999 Elect Engr & Computer Science - Doctoral Dissertation ( 1-12 )",
      "description": "",
      "terms": [
        "4212",
        "4216",
        "4219",
        "4222",
        "4226"
      ]
    },
    "4229": {
      "miniDesc": "EECS 999 Elect Engr & Computer Science - Doctoral Dissertation ( 1-12 )",
      "description": "Graded on a satisfactory progress/limited progress/no progress basis.",
      "terms": [
        "4229",
        "4232"
      ]
    }
  }
}